<template>
  <section class="hero"  >
    <div class="hero__container">
      <h1 class="hero__heading">
        Международное хореографическое <br />движение «Танцуй, Россия»
      </h1>
      <div class="hero__content">
        <div class="hero__text">
          <p><b>Миссия:</b> Помогать, поддерживать и приносить реальную пользу каждому
            ребенку, педагогу и коллективу, стремящемуся к развитию в мире
            хореографии. Мы создаём доступную и вдохновляющую среду,где талант
            может расти, а усилия — превращаться в результат.</p>
          <p><b>Цель:</b> Не просто конкурсы, а путь, по которому дети обретают
            уверенность, педагоги —поддержку, а коллективы — возможности для
            роста, признания и новых горизонтов.</p>
        </div>
        <button class="button-1">Подать заявку</button>
      </div>
    </div>
  </section>
</template>

<script>
export default {};
</script>

<style scoped>

</style>