<template>
  <div class="modal-overlay">
    <button class="close-btn" @click="$emit('close')">✕</button>

    <div class="modal-content">
      <!-- Текст -->
      <div class="body">
        <h2>ПРАВИЛА ПОЛЬЗОВАНИЯ КАРТОЙ</h2>

        <p>
          Для прохождения на следующий этап руководителю необходимо
          отсканировать свой персональный QR-код, который расположен в карте
          резидента/президента. Сделать это нужно в день конкурса. После
          сканирования в вашем личном электронном кабинете автоматически
          появится печать, подтверждающая ваше участие и переход на следующий
          уровень. Это важно для вашего дальнейшего продвижения и получения всех
          бонусов.
        </p>

        <p>
          Если стоит отметка в личном электронном кабинете давности более 1
          года, то коллектив не может претендовать на привилегии данного этапа.
          Он автоматически возвращается назад к этапу карты “Выдача стипендии” и
          заново движется по этапам, участвуя в наших конкурсах.
        </p>

        <p>
          Для того, чтобы стабильно продвигаться по этапам карты
          резидента/президента и получать самые крутые привилегии от МХД
          "Танцуй, Россия!" необходимо участвовать хотя бы 1 раз в год на офлайн
          конкурсах и приносить карту резидента/президента для сканирования
          личного QR кода в дату конкурса.
        </p>

        <p>
          Если в дату конкурса коллектив не предоставил карту
          резидента/президента для сканирования личного QR кода, на следующем
          конкурсе QR код "заочно" сканироваться не будет. Таким образом даже
          будучи участником конкурса, Вы не продвинетесь далее по этапу. Совет:
          никогда не забывать приносить карту резидента/президента главному
          организатору в день участия на конкурсе для сканирования личного QR
          кода.
        </p>
        <p>
          Если коллектив не участвовал в любых наших офлайн конкурсах уже более
          6 месяцев - стипендия обнуляется и перестает копиться и выдаваться.
          Совет: участвовать в любом нашем офлайн проекте хотя бы 1 раз в пол
          года для того, чтобы копилась большая стипендия и не обнулялась.
        </p>
        <p>
          Если коллектив потерял карту резидента/президента, он может заново
          получить ее путем достижения лауреатства на любом офлайн конкурсе.
          Важно: этапы не сохранятся. Вы начнете с 1-го этапа. Также обнулится
          стипендия. Совет: ни в коем случае не терять карту
          резидента/президента.
        </p>
        <p>
          Если коллектив принимал участие в каком-либо нашем проекте и не
          потратил всю накопившуюся стипендию на данном проекте, то при
          соблюдении всех вышеупомянутых условий, он может воспользоваться
          остатком стипендии на следующем проекте (если реализация проекта не
          позднее 6 месяцев от срока того, в котором участвовал коллектив)
        </p>
        <p>
          Для того чтобы воспользоваться бонусами карты резидента/президента
          руководителю коллектива нужно заполнить гугл форму , которую высылает
          личный куратор. Таким образом отдел бронирования или отдел снабжения
          возьмет заявку в работу.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style scoped lang="scss">
.modal-overlay {
  position: fixed;
  inset: 0;
  background: #fff;
  z-index: 1000;
  padding-top: 19vw;
  overflow-y: auto;
  -webkit-overflow-scrolling: touch;
}

/* Кнопка закрытия */
.close-btn {
  position: fixed;
  top: 16px;
  right: 16px;
  font-size: 26px;
  background: none;
  border: none;
  cursor: pointer;
  z-index: 1100;
}

/* Контент */
.modal-content {
  max-width: 900px;
  margin: 0 auto;

  padding: 10vw 30vw 5vw;
}

/* 📱 Телефон */
@media (max-width: 768px) {

  .modal-content {
    max-width: 900px;
    margin: 0 auto;

    padding: 140vw 10vw 5vw;
  }

  
}
</style>
