<template>

  <section class="qc-hero">
    <div class="container qc-container">
      <h1 class="qc-hero__heading">Международное хореографическое <br/>движение «Танцуй, Россия»</h1>

      <p>Миссия: Помогать, поддерживать и приносить реальную пользу каждому ребенку, педагогу и коллективу, стремящемуся к развитию в мире хореографии.
Мы создаём доступную и вдохновляющую среду,где талант может расти,
а усилия — превращаться в результат.</p>
    </div>
  </section>
</template>

<script>

export default {

}
</script>

<style>

</style>